data/raw/qemu-ramalho/benchmark_qemu_localhost.localdomain_20260626_204734.txt
=== BENCHMARK QEMU PURO: localhost.localdomain — 20260626_204734 ===
Ambiente: QEMU puro (TCG) — IBM Power9 ppc64le — SEM testes de GPU

========================================================================

=== INFO DO SISTEMA ===
Linux localhost.localdomain 4.18.0-553.16.1.el8_10.ppc64le #1 SMP Thu Aug 8 04:07:00 PDT 2024 ppc64le ppc64le ppc64le GNU/Linux
CPUs disponíveis: 16
              total        used        free      shared  buff/cache   available
Mem:           63Gi       541Mi        62Gi        29Mi       644Mi        62Gi
Swap:            0B          0B          0B
Swap: 0 dispositivo(s)

========================================================================

=== INFO DO FILESYSTEM ===
Filesystem     Type  Size  Used Avail Use% Mounted on
/dev/vda3      xfs   228G   29G  200G  13% /
/dev/vda3 on / type xfs (rw,relatime,attr2,inode64,logbufs=8,logbsize=32k,noquota)

========================================================================

=== CGROUP DO PROCESSO ===
12:cpuset:/
11:devices:/user.slice
10:memory:/user.slice/user-0.slice/session-1.scope
9:rdma:/
8:cpu,cpuacct:/
7:freezer:/
6:pids:/user.slice/user-0.slice/session-1.scope
5:blkio:/
4:perf_event:/
3:hugetlb:/
2:net_cls,net_prio:/
1:name=systemd:/user.slice/user-0.slice/session-1.scope

========================================================================

=== CPU ===
stress-ng: info:  [1809] setting to a 60 second run per stressor
stress-ng: info:  [1809] dispatching hogs: 16 cpu
stress-ng: info:  [1815] stressor terminated with unexpected signal signal 4 'SIGILL'
stress-ng: info:  [1820] stressor terminated with unexpected signal signal 4 'SIGILL'
stress-ng: info:  [1824] stressor terminated with unexpected signal signal 4 'SIGILL'
stress-ng: info:  [1825] stressor terminated with unexpected signal signal 4 'SIGILL'
stress-ng: info:  [1826] stressor terminated with unexpected signal signal 4 'SIGILL'
stress-ng: info:  [1809] stressor       bogo ops real time  usr time  sys time   bogo ops/s     bogo ops/s
stress-ng: info:  [1809]                           (secs)    (secs)    (secs)   (real time) (usr+sys time)
stress-ng: info:  [1809] cpu                 645      2.00     31.79      0.09       323.14          20.23
stress-ng: fail:  [1809] cpu instance 4 corrupted bogo-ops counter, 42 vs 0
stress-ng: fail:  [1809] cpu instance 4 hash error in bogo-ops counter and run flag, 3366848692 vs 0
stress-ng: fail:  [1809] cpu instance 9 corrupted bogo-ops counter, 42 vs 0
stress-ng: fail:  [1809] cpu instance 9 hash error in bogo-ops counter and run flag, 3366848692 vs 0
stress-ng: fail:  [1809] cpu instance 13 corrupted bogo-ops counter, 42 vs 0
info: 5 failures reached, aborting stress process
stress-ng: fail:  [1809] cpu instance 13 hash error in bogo-ops counter and run flag, 3366848692 vs 0
stress-ng: fail:  [1809] cpu instance 14 corrupted bogo-ops counter, 42 vs 0
stress-ng: fail:  [1809] cpu instance 14 hash error in bogo-ops counter and run flag, 3366848692 vs 0
stress-ng: fail:  [1809] cpu instance 15 corrupted bogo-ops counter, 42 vs 0
stress-ng: fail:  [1809] cpu instance 15 hash error in bogo-ops counter and run flag, 3366848692 vs 0
stress-ng: fail:  [1809] metrics-check: stressor metrics corrupted, data is compromised
stress-ng: info:  [1809] unsuccessful run completed in 3.24s

========================================================================

=== MEMÓRIA ===
stress-ng: info:  [1836] setting to a 60 second run per stressor
stress-ng: info:  [1836] dispatching hogs: 8 vm
stress-ng: info:  [1836] stressor       bogo ops real time  usr time  sys time   bogo ops/s     bogo ops/s
stress-ng: info:  [1836]                           (secs)    (secs)    (secs)   (real time) (usr+sys time)
stress-ng: info:  [1836] vm              2392064     60.16    457.61     23.35     39760.01        4973.52
stress-ng: info:  [1836] successful run completed in 60.20s (1 min, 0.20 secs)

========================================================================

=== CACHE ===
stress-ng: info:  [1865] setting to a 60 second run per stressor
stress-ng: info:  [1865] dispatching hogs: 16 cache
stress-ng: info:  [1865] stressor       bogo ops real time  usr time  sys time   bogo ops/s     bogo ops/s
stress-ng: info:  [1865]                           (secs)    (secs)    (secs)   (real time) (usr+sys time)
stress-ng: info:  [1865] cache            540329     60.00    659.52    150.38      9005.35         667.16
stress-ng: info:  [1865] successful run completed in 60.05s (1 min, 0.05 secs)

========================================================================

=== STREAM — LARGURA DE BANDA DE MEMÓRIA ===
-------------------------------------------------------------
STREAM version $Revision: 5.10 $
-------------------------------------------------------------
This system uses 8 bytes per array element.
-------------------------------------------------------------
Array size = 80000000 (elements), Offset = 0 (elements)
Memory per array = 610.4 MiB (= 0.6 GiB).
Total memory required = 1831.1 MiB (= 1.8 GiB).
Each kernel will be executed 10 times.
 The *best* time for each kernel (excluding the first iteration)
 will be used to compute the reported bandwidth.
-------------------------------------------------------------
Number of Threads requested = 16
Number of Threads counted = 16
-------------------------------------------------------------
Your clock granularity appears to be less than one microsecond.
Each test below will take on the order of 205496 microseconds.
   (= 205496 clock ticks)
Increase the size of the arrays if this shows that
you are not getting at least 20 clock ticks per test.
-------------------------------------------------------------
WARNING -- The above is only a rough guideline.
For best results, please be sure you know the
precision of your system timer.
-------------------------------------------------------------
Function    Best Rate MB/s  Avg time     Min time     Max time
Copy:               0.0     0.038120  340282346638528859811704183484516925440.000000     0.000000
Scale:              0.0     0.186859  340282346638528859811704183484516925440.000000     0.000000
Add:                0.0     0.208884  340282346638528859811704183484516925440.000000     0.000000
Triad:              0.0     0.239256  340282346638528859811704183484516925440.000000     0.000000
-------------------------------------------------------------
Solution Validates: avg error less than 1.000000e-13 on all three arrays
-------------------------------------------------------------

========================================================================


=== [DISCO_EXT4] PRÉ-ALOCAÇÃO DO ARQUIVO DE TESTE (80G) ===
precreate: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
fio-3.19
Starting 1 process
precreate: Laying out IO file (1 file / 81920MiB)

precreate: (groupid=0, jobs=1): err= 0: pid=1923: Fri Jun 26 20:53:31 2026
  write: IOPS=419, BW=419MiB/s (440MB/s)(80.0GiB/195430msec); 0 zone resets
    slat (usec): min=108, max=5270, avg=349.12, stdev=145.59
    clat (msec): min=9, max=291, avg=75.87, stdev=14.83
     lat (msec): min=9, max=311, avg=76.27, stdev=14.85
    clat percentiles (msec):
     |  1.00th=[   41],  5.00th=[   63], 10.00th=[   65], 20.00th=[   69],
     | 30.00th=[   71], 40.00th=[   71], 50.00th=[   73], 60.00th=[   75],
     | 70.00th=[   79], 80.00th=[   83], 90.00th=[   89], 95.00th=[   97],
     | 99.00th=[  134], 99.50th=[  150], 99.90th=[  222], 99.95th=[  245],
     | 99.99th=[  262]
   bw (  KiB/s): min=260580, max=525232, per=100.00%, avg=429904.23, stdev=44056.78, samples=385
   iops        : min=  254, max=  512, avg=419.32, stdev=43.01, samples=385
  lat (msec)   : 10=0.01%, 20=0.09%, 50=1.52%, 100=94.32%, 250=4.04%
  lat (msec)   : 500=0.03%
  cpu          : usr=10.62%, sys=15.07%, ctx=78630, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,81920,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=419MiB/s (440MB/s), 419MiB/s-419MiB/s (440MB/s-440MB/s), io=80.0GiB (85.9GB), run=195430-195430msec

Disk stats (read/write):
  vda: ios=0/82132, merge=0/47, ticks=0/6172555, in_queue=6172555, util=100.00%

=== [DISCO_EXT4] LEITURA SEQUENCIAL ===
seq-read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
...
fio-3.19
Starting 4 processes

seq-read: (groupid=0, jobs=4): err= 0: pid=1944: Fri Jun 26 20:54:35 2026
  read: IOPS=487, BW=487MiB/s (511MB/s)(28.6GiB/60136msec)
    slat (usec): min=88, max=86949, avg=2830.41, stdev=7774.09
    clat (msec): min=72, max=1074, avg=256.85, stdev=83.83
     lat (msec): min=72, max=1088, avg=261.01, stdev=84.73
    clat percentiles (msec):
     |  1.00th=[  113],  5.00th=[  144], 10.00th=[  163], 20.00th=[  186],
     | 30.00th=[  209], 40.00th=[  228], 50.00th=[  247], 60.00th=[  268],
     | 70.00th=[  292], 80.00th=[  321], 90.00th=[  363], 95.00th=[  405],
     | 99.00th=[  506], 99.50th=[  550], 99.90th=[  768], 99.95th=[  885],
     | 99.99th=[ 1036]
   bw (  KiB/s): min=178905, max=822599, per=99.86%, avg=498386.11, stdev=29901.67, samples=436
   iops        : min=  173, max=  802, avg=484.83, stdev=29.19, samples=436
  lat (msec)   : 100=0.41%, 250=51.50%, 500=47.01%, 750=0.97%, 1000=0.11%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.35%, sys=97.14%, ctx=402, majf=1, minf=2092
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=99.6%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=29309,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=487MiB/s (511MB/s), 487MiB/s-487MiB/s (511MB/s-511MB/s), io=28.6GiB (30.7GB), run=60136-60136msec

Disk stats (read/write):
  vda: ios=29501/9, merge=0/1, ticks=4022903/1062, in_queue=4023965, util=82.39%

=== [DISCO_EXT4] ESCRITA SEQUENCIAL ===
seq-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
...
fio-3.19
Starting 4 processes

seq-write: (groupid=0, jobs=4): err= 0: pid=1955: Fri Jun 26 20:55:38 2026
  write: IOPS=424, BW=425MiB/s (445MB/s)(24.9GiB/60138msec); 0 zone resets
    slat (usec): min=113, max=223364, avg=4395.36, stdev=9601.91
    clat (msec): min=12, max=650, avg=293.68, stdev=88.42
     lat (msec): min=12, max=670, avg=300.10, stdev=89.98
    clat percentiles (msec):
     |  1.00th=[  118],  5.00th=[  161], 10.00th=[  184], 20.00th=[  218],
     | 30.00th=[  243], 40.00th=[  266], 50.00th=[  288], 60.00th=[  313],
     | 70.00th=[  338], 80.00th=[  368], 90.00th=[  414], 95.00th=[  447],
     | 99.00th=[  531], 99.50th=[  558], 99.90th=[  592], 99.95th=[  600],
     | 99.99th=[  642]
   bw (  KiB/s): min=217168, max=835659, per=100.00%, avg=435139.38, stdev=28899.72, samples=432
   iops        : min=  211, max=  813, avg=422.94, stdev=28.20, samples=432
  lat (msec)   : 20=0.02%, 50=0.12%, 100=0.32%, 250=32.45%, 500=65.39%
  lat (msec)   : 750=1.70%
  cpu          : usr=4.85%, sys=93.72%, ctx=4408, majf=1, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.3%, 32=99.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,25532,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=425MiB/s (445MB/s), 425MiB/s-425MiB/s (445MB/s-445MB/s), io=24.9GiB (26.8GB), run=60138-60138msec

Disk stats (read/write):
  vda: ios=0/25675, merge=0/0, ticks=0/3813331, in_queue=3813330, util=78.42%

=== [DISCO_EXT4] IOPS ALEATÓRIO (4K randrw 70/30) ===
rand-rw: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.19
Starting 4 processes

rand-rw: (groupid=0, jobs=4): err= 0: pid=1966: Fri Jun 26 20:56:41 2026
  read: IOPS=6556, BW=25.6MiB/s (26.9MB/s)(1537MiB/60004msec)
    slat (usec): min=65, max=12940, avg=174.58, stdev=229.83
    clat (usec): min=361, max=274903, avg=24220.19, stdev=10733.07
     lat (usec): min=510, max=276009, avg=24447.84, stdev=10798.99
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   17], 10.00th=[   18], 20.00th=[   20],
     | 30.00th=[   21], 40.00th=[   22], 50.00th=[   23], 60.00th=[   24],
     | 70.00th=[   26], 80.00th=[   27], 90.00th=[   30], 95.00th=[   34],
     | 99.00th=[   67], 99.50th=[   93], 99.90th=[  144], 99.95th=[  167],
     | 99.99th=[  268]
   bw (  KiB/s): min= 9024, max=35813, per=100.00%, avg=26251.42, stdev=1254.12, samples=468
   iops        : min= 2255, max= 8953, avg=6561.38, stdev=313.53, samples=468
  write: IOPS=2816, BW=11.0MiB/s (11.5MB/s)(660MiB/60004msec); 0 zone resets
    slat (usec): min=68, max=224002, avg=190.63, stdev=969.40
    clat (usec): min=390, max=285542, avg=33299.32, stdev=12097.42
     lat (usec): min=597, max=286517, avg=33554.73, stdev=12185.69
    clat percentiles (msec):
     |  1.00th=[   21],  5.00th=[   23], 10.00th=[   25], 20.00th=[   27],
     | 30.00th=[   29], 40.00th=[   31], 50.00th=[   32], 60.00th=[   34],
     | 70.00th=[   35], 80.00th=[   38], 90.00th=[   41], 95.00th=[   47],
     | 99.00th=[   81], 99.50th=[  110], 99.90th=[  159], 99.95th=[  245],
     | 99.99th=[  284]
   bw (  KiB/s): min= 4025, max=15395, per=100.00%, avg=11271.37, stdev=545.08, samples=468
   iops        : min= 1004, max= 3848, avg=2816.44, stdev=136.28, samples=468
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=18.60%, 50=79.04%
  lat (msec)   : 100=1.87%, 250=0.44%, 500=0.03%
  cpu          : usr=7.50%, sys=91.46%, ctx=16046, majf=1, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=393415,168998,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=25.6MiB/s (26.9MB/s), 25.6MiB/s-25.6MiB/s (26.9MB/s-26.9MB/s), io=1537MiB (1611MB), run=60004-60004msec
  WRITE: bw=11.0MiB/s (11.5MB/s), 11.0MiB/s-11.0MiB/s (11.5MB/s-11.5MB/s), io=660MiB (692MB), run=60004-60004msec

Disk stats (read/write):
  vda: ios=393212/168883, merge=0/2, ticks=315571/125184, in_queue=440754, util=99.53%

=== [DISCO_EXT4] LATÊNCIA (4K randread síncrono) ===
lat-read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.19
Starting 1 process

lat-read: (groupid=0, jobs=1): err= 0: pid=1977: Fri Jun 26 20:57:44 2026
  read: IOPS=1568, BW=6272KiB/s (6423kB/s)(368MiB/60002msec)
    slat (usec): min=91, max=2064, avg=122.53, stdev=33.73
    clat (usec): min=22, max=99031, avg=453.58, stdev=434.94
     lat (usec): min=376, max=99168, avg=591.64, stdev=436.69
    clat percentiles (usec):
     |  1.00th=[  277],  5.00th=[  314], 10.00th=[  326], 20.00th=[  330],
     | 30.00th=[  343], 40.00th=[  347], 50.00th=[  355], 60.00th=[  367],
     | 70.00th=[  379], 80.00th=[  392], 90.00th=[  947], 95.00th=[ 1205],
     | 99.00th=[ 1450], 99.50th=[ 1696], 99.90th=[ 2147], 99.95th=[ 2409],
     | 99.99th=[ 5604]
   bw (  KiB/s): min= 2603, max= 7545, per=100.00%, avg=6306.24, stdev=1625.61, samples=118
   iops        : min=  650, max= 1886, avg=1576.19, stdev=406.36, samples=118
  lat (usec)   : 50=0.14%, 100=0.01%, 250=0.10%, 500=87.53%, 750=1.01%
  lat (usec)   : 1000=1.47%
  lat (msec)   : 2=9.55%, 4=0.17%, 10=0.02%, 100=0.01%
  cpu          : usr=7.23%, sys=46.39%, ctx=92610, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=94084,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6272KiB/s (6423kB/s), 6272KiB/s-6272KiB/s (6423kB/s-6423kB/s), io=368MiB (385MB), run=60002-60002msec

Disk stats (read/write):
  vda: ios=93999/6, merge=0/0, ticks=40319/20, in_queue=40338, util=99.87%

=== [DISCO_EXT4] REMOVENDO ARQUIVO DE TESTE ===
Arquivo removido: /root/fio_testfile

========================================================================


=== FIM ===
Resultados salvos em: /root/experimentos/benchmark_qemu_localhost.localdomain_20260626_204734.txt